xmlsamples/DAS_Query/PROD-PH-FeeInquiry-AIS-PH259.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi">
   <soapenv:Header/>
   <soapenv:Body>
      <xrsi:fee-inquiry-request>
         <channel>
            <type>H2H</type>
            <name>PetNet</name>
            <version>9500</version>
         </channel>
         <financials>
            <originators_principal_amount>10000</originators_principal_amount>
         </financials>
         <payment_details>
            <recording_country_currency>
               <iso_code>
                  <country_code>PH</country_code>
                  <currency_code>PHP</currency_code>
               </iso_code>
            </recording_country_currency>
            <destination_country_currency>
               <iso_code>
                  <country_code>CN</country_code>
                  <currency_code>USD</currency_code>
               </iso_code>
            </destination_country_currency>
            <originating_country_currency>
               <iso_code>
                  <country_code>PH</country_code>
                  <currency_code>PHP</currency_code>
               </iso_code>
            </originating_country_currency>
            <transaction_type>WMN</transaction_type>
         </payment_details>
         <delivery_services>
            <code>000</code>
         </delivery_services>
         <foreign_remote_system>
            <identifier>WGHHPH2592P</identifier>
            <reference_no>29997000141024240</reference_no>
            <counter_id>PH259AM0116L</counter_id>
         </foreign_remote_system>
      </xrsi:fee-inquiry-request>
   </soapenv:Body>
</soapenv:Envelope>